/*
  Query: ค้นหาหนังที่ได้เรตติ้งสูงและมียอดวิจารณ์เยอะ
  
  1. ค้นหาหนังที่มีเรตติ้ง IMDB ตั้งแต่ 8.5 ขึ้นไป ($gte)
  2. กรองเฉพาะหนังที่มียอดโหวต (imdb.votes) มากกว่า 10,000 เพื่อความน่าเชื่อถือ
  3. ใช้การ .sort() เพื่อเรียงลำดับจากหนังที่ใหม่ที่สุด (year: -1)
  4. ใช้ .limit() เพื่อดึงมาแค่ 5 อันดับแรก
*/

        use('sample_mflix');

        db.movies.find(
        { 
            "imdb.rating": { $gte: 8.5 },
            "imdb.votes": { $gt: 10000 }
        },
        { title: 1, year: 1, "imdb.rating": 1, _id: 0 }
        ).sort({ year: -1 }).limit(5);

/*
  Understanding:
  ความเข้าใจของผมคือการใช้ตัวดำเนินการเปรียบเทียบ ($gte, $gt) ร่วมกับ Dot Notation 
  ช่วยให้เราคัดกรองข้อมูลจากฐานข้อมูลขนาดใหญ่อย่าง Mflix ได้แม่นยำ 
  และการใช้ Method ต่อท้ายอย่าง sort และ limit คือหัวใจสำคัญในการจัดระเบียบข้อมูลก่อนส่งไปหน้าเว็บครับ
*/